app/Actions/CreateUserAction.php

insert into `users` (`name`, `username`, `email`, `password`, `role`, `updated_at`, `created_at`) values ('Jeanbr2025', 'jeanbr2025', 'jean.miquelino@etec.sp.gov.br', '$2y$10$.0VpFFth/QG7Darv22spdeLaxcokddah2Xisg0.ooqFx46q3O7wWm', 'user', '2024-09-15 02:34:29', '2024-09-15 02:34:29')
insert into `user_profiles` (`user_id`, `updated_at`, `created_at`) values (4, '2024-09-15 02:34:29', '2024-09-15 02:34:29')
---
    public function execute(
        string $username,
        string $email,
        string $name,
        string $password,
        string $role,
        bool $skipEmailVerification = false
    ): User {
        $user = User::create([
            'name' => $name,
            'username' => $username,
            'email' => $email,
            'password' => $password,
            'role' => $role,
        ]);

        $user->profile()->create();