app/Http/View/Composers/UserHeaderComposer.php

    public function compose(View $view): void
    {
        $user = User::with([
            'profile',
        ])->find(
            Auth::id(),
            ['id', 'name', 'username', 'created_at']
        );
---
select * from `user_profiles` where `user_profiles`.`user_id` in (1)
select `id`, `name`, `username`, `created_at` from `users` where `users`.`id` = 1 limit 1