app/Listeners/AddBadgesOnQuestionAnswered.php

    public function handle(QuestionAnswered $event): void
    {
        $user = $event->user;

        Badge::query()
            ->whereIn('actuators', [
                BadgeActuators::OnQuestionAnswered,
                ($event->correctness === true)
                    ? BadgeActuators::OnQuestionCorrectlyAnswered
                    : BadgeActuators::OnQuestionIncorrectlyAnswered,
            ])
            ->when($event->question->tagArrayNormalized, function ($query) use ($event) {
                $query->withAnyTags($event->question->tagArrayNormalized);
            }, function ($query) {
                $query->isNotTagged();
            })
            ->get()
            ->each(function ($badge) use ($user) {
                Game::incrementBadgeCount($user, $badge);
            });
---
select `badges`.* from `badges` inner join `taggable_taggables` as `taggable_taggables_scopewithanytags_1` on `badges`.`id` = `taggable_taggables_scopewithanytags_1`.`taggable_id` and `taggable_taggables_scopewithanytags_1`.`taggable_type` = 'Gamify\Models\Badge' where `actuators` in (1, 2) and `taggable_taggables_scopewithanytags_1`.`tag_id` in (2) and `badges`.`deleted_at` is null group by `badges`.`id`