app/Listeners/AddBadgesOnUserLoggedIn.php

    public function handle(Login|SocialLogin $event): void
    {
        /** @var User $user */
        $user = $event->user;

        Badge::query()
            ->whereActuators(BadgeActuators::OnUserLoggedIn)
            ->get()
            ->each(function ($badge) use ($user) {
                Game::incrementBadgeCount($user, $badge);
            });
---
select * from `badges` where `actuators` = 8 and `badges`.`deleted_at` is null