app/Listeners/AddReputation.php

    public function handle(QuestionAnswered $event): void
    {
        $user = $event->user;
        $pointsEarned = $event->points;
        $questionName = $event->question->name;

        $user->points()->create([
            'points' => $pointsEarned,
            'description' => "earned $pointsEarned points for answering the question '$questionName'",
        ]);
---
insert into `points` (`points`, `description`, `user_id`, `updated_at`, `created_at`) values (5, 'earned 5 points for answering the question \'teste\'', 1, '2024-09-15 04:12:54', '2024-09-15 04:12:54')