app/Listeners/UpdateCachedUserExperience.php

    public function handle(PointCreated|PointDeleted $event): void
    {
        $user = $event->point->user;

        Cache::put('user_experience_'.$user->id, $user->points()->sum('points'), 600);
---
select sum(`points`) as aggregate from `points` where `points`.`user_id` = 1 and `points`.`user_id` is not null