app/Http/Controllers/MarkNotificationAsReadController.php

select * from `users` where `users`.`id` = 1 limit 1
---
    public function __invoke(Request $request): Response
    {
        /** @var User $user */
        $user = User::findOrFail(Auth::id());