app/Http/Controllers/QuestionController.php

    public function answer(QuestionAnswerRequest $request, Question $question): View
    {
        /** @var User $user */
        $user = User::findOrFail(Auth::id());
---
select * from `users` where `users`.`id` = 1 limit 1

    public function show(Question $question): View
    {
        /** @var User $user */
        $user = User::findOrFail(Auth::id());
---
select * from `users` where `users`.`id` = 1 limit 1