app/Models/Badge.php

    public static function triggeredByQuestionsWithTagsIn(array $tags): Collection
    {
        return self::query()
            ->active()
            ->hasAnyFlags('actuators', BadgeActuators::triggeredByQuestions())
            ->when($tags, function ($query) use ($tags) {
                $query->withAnyTags($tags);
            }, function ($query) {
                $query->isNotTagged();
            })
            ->get();
---
select `badges`.* from `badges` inner join `taggable_taggables` as `taggable_taggables_scopewithanytags_1` on `badges`.`id` = `taggable_taggables_scopewithanytags_1`.`taggable_id` and `taggable_taggables_scopewithanytags_1`.`taggable_type` = 'Gamify\Models\Badge' where `active` = 1 and actuators & 7 > 0 and `taggable_taggables_scopewithanytags_1`.`tag_id` in (1) and `badges`.`deleted_at` is null group by `badges`.`id`