app/Models/User.php

select `badges`.*, `users_badges`.`user_id` as `pivot_user_id`, `users_badges`.`badge_id` as `pivot_badge_id`, `users_badges`.`repetitions` as `pivot_repetitions`, `users_badges`.`unlocked_at` as `pivot_unlocked_at` from `badges` inner join `users_badges` on `badges`.`id` = `users_badges`.`badge_id` where `users_badges`.`user_id` = 1 and `users_badges`.`badge_id` = 2 and `badges`.`deleted_at` is null limit 1
---
    public function progressToCompleteTheBadge(Badge $badge): ?UserBadgeProgress
    {
        return $this->badges()
            ->wherePivot('badge_id', $badge->id)
            ->first()
            ->progress ?? null;

select `badges`.*, `users_badges`.`user_id` as `pivot_user_id`, `users_badges`.`badge_id` as `pivot_badge_id`, `users_badges`.`repetitions` as `pivot_repetitions`, `users_badges`.`unlocked_at` as `pivot_unlocked_at` from `badges` inner join `users_badges` on `badges`.`id` = `users_badges`.`badge_id` where `users_badges`.`user_id` = 1 and `users_badges`.`unlocked_at` is not null and `badges`.`deleted_at` is null
---
    public function unlockedBadges(): Collection
    {
        return $this->badges()
            ->wherePivotNotNull('unlocked_at')
            ->get();

select `badges`.*, `users_badges`.`user_id` as `pivot_user_id`, `users_badges`.`badge_id` as `pivot_badge_id`, `users_badges`.`repetitions` as `pivot_repetitions`, `users_badges`.`unlocked_at` as `pivot_unlocked_at` from `badges` inner join `users_badges` on `badges`.`id` = `users_badges`.`badge_id` where `users_badges`.`user_id` = 1 and `users_badges`.`unlocked_at` is null and `badges`.`deleted_at` is null
---
    public function lockedBadges(): Collection
    {
        return $this->badges()
            ->wherePivotNull('unlocked_at')
            ->get();

select exists(select * from `badges` inner join `users_badges` on `badges`.`id` = `users_badges`.`badge_id` where `users_badges`.`user_id` = 1 and `users_badges`.`badge_id` = 2 and `users_badges`.`unlocked_at` is not null and `badges`.`deleted_at` is null) as `exists`
---
    public function hasUnlockedBadge(Badge $badge): bool
    {
        return $this->badges()
            ->wherePivot('badge_id', $badge->id)
            ->wherePivotNotNull('unlocked_at')
            ->exists();

select sum(`points`) as aggregate from `points` where `points`.`user_id` is null and `points`.`user_id` is not null
---
    protected function experience(): Attribute
    {
        return Attribute::make(
            get: fn () => Cache::remember('user_experience_'.$this->id, 600, function () {
                return $this->points()->sum('points');