app/Providers/RouteServiceProvider.php

select * from `users` where `username` = 'jeanbr2006' limit 1
select * from `questions` where `questions`.`id` = 2 and `questions`.`deleted_at` is null limit 1
---
    protected function registerBindings(): self
    {
        Route::model('users', User::class);
        Route::model('badges', Badge::class);
        Route::model('levels', Level::class);
        Route::model('questions', Question::class);

        Route::bind('username', function (string $value) {
            return User::where('username', $value)->firstOrFail();
        });

        Route::bind('q_hash', function (string $value) {
            try {
                $hashIdService = app(HashIdService::class);

                $id = $hashIdService->decode($value);

                return Question::findOrFail($id);