app/Http/Controllers/Admin/AdminBadgeController.php

    public function store(BadgeCreateRequest $request): RedirectResponse
    {
        $badge = Badge::create([
            'name' => $request->name(),
            'description' => $request->description(),
            'required_repetitions' => $request->repetitions(),
            'active' => $request->active(),
            'actuators' => $request->actuators(),
        ]);
---
insert into `badges` (`name`, `description`, `required_repetitions`, `active`, `actuators`, `updated_at`, `created_at`) values ('Casa', 'Logue 5 Vezes', 5, 1, 8, '2024-09-15 04:09:01', '2024-09-15 04:09:01')