app/Http/Controllers/Admin/AdminDashboardController.php

select count(*) as aggregate from `badges` where `active` = 1 and `badges`.`deleted_at` is null
select count(*) as aggregate from `levels` where `active` = 1 and `levels`.`deleted_at` is null
select * from `users` order by `created_at` desc limit 5
---
    public function __invoke(): View
    {
        return view('admin.dashboard.index', [
            'badges_count' => Badge::active()->count(),
            'questions_count' => Question::published()->count(),
            'players_count' => User::player()->count(),
            'levels_count' => Level::active()->count(),
            'latest_users' => User::orderBy('created_at', 'desc')->take(5)->get(),
            'latest_questions' => Question::published()->orderBy('publication_date', 'desc')->take(5)->get(),
            'next_scheduled_questions' => Question::scheduled()->orderBy('publication_date', 'asc')->take(5)->get(),
        ]);