app/Http/Controllers/Admin/AdminRewardController.php

select `name`, `id` from `badges` where `active` = 1 and `badges`.`deleted_at` is null
---
    public function index(): View
    {
        $users = User::query()
            ->player()
            ->pluck('username', 'username');

        $badges = Badge::query()
            ->active()
            ->pluck('name', 'id');

select * from `users` where `username` = 'jeanbr2025' limit 1
insert into `points` (`points`, `description`, `user_id`, `updated_at`, `created_at`) values (5, 'teste', 4, '2024-09-15 04:09:12', '2024-09-15 04:09:12')
---
    public function giveExperience(RewardExperienceRequest $request): RedirectResponse
    {
        /** @var User $user */
        $user = User::where('username', $request->usernameToReward())
            ->firstOrFail();

        $user->points()->create([
            'points' => $request->experience(),
            'description' => $request->reason(),
        ]);